/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   last_word.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: nisu <nisu@student.42.fr>                  +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2026/09/01 18:59:14 by nisu              #+#    #+#             */
/*   Updated: 2026/09/01 21:19:45 by nisu             ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

//

#include <unistd.h>

int	main(int argc, char **argv)
{
	int	i;

	i = 0;
	if (argc != 2)
	{
		write (1, "\n", 1);
		return (0);
	}
	while (argv[1][i] != '\0')
		i++; // i = 6
	i--; // i = 5
	while (i >= 0 && (argv[1][i] == ' ' || argv[1][i] == '\t')) // i >= 0 必须放在前面，因为 C 的 && 是从左往右计算的，如果写 argv[1][i] ... && i >= 0，当 i == -1 时会先访问 argv[1][-1]
		i--; // i = 4
	int	end = i; // end = 4
	while (i >= 0 &&argv[1][i] != ' ' && argv[1][i] != '\t')
		i--; // i = -1
	i++; //i = 0
	while (i <= end )
	{
		write (1, &argv[1][i], 1);
		i++;
	}
	write (1, "\n", 1);
	return (0);
}
